# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategorySet..::..ForwardIterator Method
CategorySet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual CategorySetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As CategorySetIterator
```

Visual C++
---
```text
public:
virtual CategorySetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
CategorySet Class
Autodesk.Revit.DB Namespace